[GrimyBonusTimeBscUpgrade X2WeaponUpgradeTemplate]
FriendlyName="Secure Comms"
FriendlyNamePlural="Secure Comms"
BriefSummary="Increases turn time by 5 seconds."
TinySummary="Increased Turn Time"
LootTooltip="This armor upgrade will help us coordinate our soldiers more effectively."

[GrimyBonusTimeAdvUpgrade X2WeaponUpgradeTemplate]
FriendlyName="Advanced Secure Comms"
FriendlyNamePlural="Advanced Secure Comms"
BriefSummary="Increases turn time by 10 seconds."
TinySummary="Increased Turn Time"
LootTooltip="This armor upgrade will help us coordinate our soldiers more effectively."

[GrimyBonusTimeSupUpgrade X2WeaponUpgradeTemplate]
FriendlyName="Superior Secure Comms"
FriendlyNamePlural="Superior Secure Comms"
BriefSummary="Increases turn time by 15 seconds."
TinySummary="Increased Turn Time"
LootTooltip="This armor upgrade will help us coordinate our soldiers more effectively."
